Ran Plan for 8 projects:

1. dir: `infra/us-east-1/dev/eks/kubevela-addons` workspace: `infra_us-east-1_dev_eks_kubevela-addons`
1. dir: `infra/us-east-1/dev/rds/security-group` workspace: `infra_us-east-1_dev_rds_security-group`
1. dir: `infra/us-east-1/dev/eks/cluster` workspace: `infra_us-east-1_dev_eks_cluster`
1. dir: `infra/us-east-1/dev/eks/honeycomb` workspace: `infra_us-east-1_dev_eks_honeycomb`
1. dir: `infra/us-east-1/dev/vpc` workspace: `infra_us-east-1_dev_vpc`
1. dir: `infra/us-east-1/dev/rds/subnet-group` workspace: `infra_us-east-1_dev_rds_subnet-group`
1. dir: `infra/us-east-1/dev/eks/cluster-addons` workspace: `infra_us-east-1_dev_eks_cluster-addons`
1. dir: `infra/us-east-1/mgmt/peering/dev` workspace: `infra_us-east-1_mgmt_peering_dev`

### 1. dir: `infra/us-east-1/dev/eks/kubevela-addons` workspace: `infra_us-east-1_dev_eks_kubevela-addons`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/118/infra_us-east-1_dev_eks_kubevela-addons/infra/us-east-1/dev/eks/kubevela-addons": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/118/infra_us-east-1_dev_eks_kubevela-addons/infra/us-east-1/dev/eks/kubevela-addons": 
time=2024-01-16T12:54:59Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/118/infra_us-east-1_dev_eks_kubevela-addons/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/118/infra_us-east-1_dev_eks_kubevela-addons/infra/us-east-1/dev/eks/cluster] 
time=2024-01-16T12:55:57Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/118/infra_us-east-1_dev_eks_kubevela-addons/infra/modules/kubevela-addons. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding gavinbunney/kubectl versions matching "~> 1.14"...
- Finding latest version of hashicorp/kubernetes...
- Finding latest version of hashicorp/helm...
- Finding latest version of hashicorp/aws...
- Installing gavinbunney/kubectl v1.14.0...
- Installed gavinbunney/kubectl v1.14.0 (self-signed, key ID AD64217B5ADD572F)
- Installing hashicorp/kubernetes v2.25.2...
- Installed hashicorp/kubernetes v2.25.2 (signed by HashiCorp)
- Installing hashicorp/helm v2.12.1...
- Installed hashicorp/helm v2.12.1 (signed by HashiCorp)
- Installing hashicorp/aws v5.32.1...
- Installed hashicorp/aws v5.32.1 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 108:
│  108: variable "secrets_namespace" {
│ 
│ The root module input variable "secrets_namespace" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 113:
│  113: variable "cluster_secrets" {
│ 
│ The root module input variable "cluster_secrets" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
time=2024-01-16T12:56:31Z level=error msg=Terraform invocation failed in /atlantis-data/repos/input-output-hk/sc-dev-platform/118/infra_us-east-1_dev_eks_kubevela-addons/infra/us-east-1/dev/eks/kubevela-addons/.terragrunt-cache/VXfZbkK5lEkyF2U7u479MY9gCX8/ZCHqtnAyjI0e-Da_LWBWZ8Huhq4 prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/118/infra_us-east-1_dev_eks_kubevela-addons/infra/us-east-1/dev/eks/kubevela-addons] 
time=2024-01-16T12:56:31Z level=error msg=1 error occurred:
	* [/atlantis-data/repos/input-output-hk/sc-dev-platform/118/infra_us-east-1_dev_eks_kubevela-addons/infra/us-east-1/dev/eks/kubevela-addons/.terragrunt-cache/VXfZbkK5lEkyF2U7u479MY9gCX8/ZCHqtnAyjI0e-Da_LWBWZ8Huhq4] exit status 1




```
</details>

---
### 2. dir: `infra/us-east-1/dev/rds/security-group` workspace: `infra_us-east-1_dev_rds_security-group`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/rds/security-group -w infra_us-east-1_dev_rds_security-group`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Frds%252Fsecurity-group%252Finfra_us-east-1_dev_rds_security-group)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/rds/security-group -w infra_us-east-1_dev_rds_security-group`

---
### 3. dir: `infra/us-east-1/dev/eks/cluster` workspace: `infra_us-east-1_dev_eks_cluster`
<details><summary>Show Output</summary>

```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
╷
│ Warning: Argument is deprecated
│ 
│   with module.eks.aws_eks_addon.this["vpc-cni"],
│   on .terraform/modules/eks/main.tf line 392, in resource "aws_eks_addon" "this":
│  392:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")
│ 
│ The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
│ resource creation. Use "resolve_conflicts_on_create" and/or
│ "resolve_conflicts_on_update" instead
│ 
│ (and 2 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/eks/cluster -w infra_us-east-1_dev_eks_cluster`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Feks%252Fcluster%252Finfra_us-east-1_dev_eks_cluster)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/eks/cluster -w infra_us-east-1_dev_eks_cluster`
</details>
No changes. Your infrastructure matches the configuration.

---
### 4. dir: `infra/us-east-1/dev/eks/honeycomb` workspace: `infra_us-east-1_dev_eks_honeycomb`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/eks/honeycomb -w infra_us-east-1_dev_eks_honeycomb`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Feks%252Fhoneycomb%252Finfra_us-east-1_dev_eks_honeycomb)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/eks/honeycomb -w infra_us-east-1_dev_eks_honeycomb`

---
### 5. dir: `infra/us-east-1/dev/vpc` workspace: `infra_us-east-1_dev_vpc`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_subnet_group.database[0] will be created
+   resource "aws_db_subnet_group" "database" {
+       arn                     = (known after apply)
+       description             = "Database subnet group for scde-dev-us-east-1"
+       id                      = (known after apply)
+       name                    = "dev-subnet-group"
+       name_prefix             = (known after apply)
+       subnet_ids              = (known after apply)
+       supported_network_types = (known after apply)
+       tags                    = {
+           "Name" = "dev-subnet-group"
        }
+       tags_all                = {
+           "Environment"  = "dev"
+           "Name"         = "dev-subnet-group"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                  = (known after apply)
    }

  # aws_route_table_association.database[0] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = "rtb-0303dbb2e0e8365ce"
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.database[1] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = "rtb-0303dbb2e0e8365ce"
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.database[2] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = "rtb-0303dbb2e0e8365ce"
+       subnet_id      = (known after apply)
    }

  # aws_subnet.database[0] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.108.0/22"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "scde-dev-us-east-1-db-us-east-1a"
        }
+       tags_all                                       = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-db-us-east-1a"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = "vpc-07838bb868f5b4c8c"
    }

  # aws_subnet.database[1] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.112.0/22"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "scde-dev-us-east-1-db-us-east-1b"
        }
+       tags_all                                       = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-db-us-east-1b"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = "vpc-07838bb868f5b4c8c"
    }

  # aws_subnet.database[2] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.116.0/22"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "scde-dev-us-east-1-db-us-east-1c"
        }
+       tags_all                                       = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-db-us-east-1c"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = "vpc-07838bb868f5b4c8c"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
!   database_route_table_association_ids        = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
!   database_subnet_arns                        = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   database_subnet_group                       = (known after apply)
+   database_subnet_group_name                  = "dev-subnet-group"
!   database_subnets                            = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
!   database_subnets_cidr_blocks                = [
+       "10.50.108.0/22",
+       "10.50.112.0/22",
+       "10.50.116.0/22",
    ]
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/vpc -w infra_us-east-1_dev_vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Fvpc%252Finfra_us-east-1_dev_vpc)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/vpc -w infra_us-east-1_dev_vpc`
</details>
Plan: 7 to add, 0 to change, 0 to destroy.

---
### 6. dir: `infra/us-east-1/dev/rds/subnet-group` workspace: `infra_us-east-1_dev_rds_subnet-group`
<details><summary>Show Output</summary>

```diff
module.db_instance.data.aws_partition.current: Reading...
module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.db_subnet_group.aws_db_subnet_group.this[0] must be replaced
-/+ resource "aws_db_subnet_group" "this" {
!       arn                     = "arn:aws:rds:us-east-1:677160962006:subgrp:dev-subnet-group" -> (known after apply)
!       id                      = "dev-subnet-group" -> (known after apply)
!       name                    = "dev-subnet-group" -> "rds-dev-subnet-group" # forces replacement
+       name_prefix             = (known after apply)
!       supported_network_types = [
-           "IPV4",
        ] -> (known after apply)
!       tags                    = {
!           "Name" = "dev-subnet-group" -> "rds-dev-subnet-group"
        }
!       tags_all                = {
!           "Name"         = "dev-subnet-group" -> "rds-dev-subnet-group"
            # (5 unchanged elements hidden)
        }
!       vpc_id                  = "vpc-07838bb868f5b4c8c" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   db_subnet_group_arn                = "arn:aws:rds:us-east-1:677160962006:subgrp:dev-subnet-group" -> (known after apply)
!   db_subnet_group_id                 = "dev-subnet-group" -> (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/rds/subnet-group -w infra_us-east-1_dev_rds_subnet-group`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Frds%252Fsubnet-group%252Finfra_us-east-1_dev_rds_subnet-group)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/rds/subnet-group -w infra_us-east-1_dev_rds_subnet-group`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
### 7. dir: `infra/us-east-1/dev/eks/cluster-addons` workspace: `infra_us-east-1_dev_eks_cluster-addons`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/eks/cluster-addons -w infra_us-east-1_dev_eks_cluster-addons`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Feks%252Fcluster-addons%252Finfra_us-east-1_dev_eks_cluster-addons)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/eks/cluster-addons -w infra_us-east-1_dev_eks_cluster-addons`

---
### 8. dir: `infra/us-east-1/mgmt/peering/dev` workspace: `infra_us-east-1_mgmt_peering_dev`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/peering/dev -w infra_us-east-1_mgmt_peering_dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fpeering%252Fdev%252Finfra_us-east-1_mgmt_peering_dev)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/peering/dev -w infra_us-east-1_mgmt_peering_dev`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`